In [2]:
import pandas as pd

In [3]:
frame = pd.DataFrame({'numbers':range(10),'chars':['a']*10})

In [4]:
frame

  chars  numbers
0     a        0
1     a        1
2     a        2
3     a        3
4     a        4
5     a        5
6     a        6
7     a        7
8     a        8
9     a        9

In [5]:
frame = pd.read_csv('dataset.tsv',header=0,sep='\t')

In [6]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [7]:
frame.columns

Index([u'Name', u'Birth', u'City', u'Position'], dtype='object')

In [8]:
frame.shape

(6, 4)

In [9]:
new_line = {'Name':'Петров','Birth':'22.10.1988','City':'Пенза'}

In [10]:
frame.append(new_line,ignore_index=True)

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6           Петров  22.10.1988      Пенза       NaN

In [11]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [12]:
frame = frame.append(new_line,ignore_index=True)

In [13]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6           Петров  22.10.1988      Пенза       NaN

In [14]:
frame['IsStudent'] = [False]*5+[True]*2

In [15]:
frame

              Name       Birth       City  Position IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN     False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер     False
2       Белов М.М.  13.02.1980     Ростов  менеджер     False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN     False
4      Рыбина Е.П.  19.11.1985     Москва   инженер     False
5     Костров С.О.  31.05.1985     Москва    стажер      True
6           Петров  22.10.1988      Пенза       NaN      True

In [19]:
frame.drop([5,6],axis=0,inplace=True)

ValueError: labels [5 6] not contained in axis

In [20]:
frame

              Name       Birth       City  Position IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN     False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер     False
2       Белов М.М.  13.02.1980     Ростов  менеджер     False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN     False
4      Рыбина Е.П.  19.11.1985     Москва   инженер     False

In [21]:
frame.drop('IsStudent',axis=1,inplace=True)

In [22]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер

In [25]:
frame.to_csv('updated_dataset.csv',sep=',',header=True,index=None)

In [27]:
%%cmd
chcp 65001
type updated_dataset.csv

Microsoft Windows [Version 6.1.7601]
Copyright (c) 2009 Microsoft Corporation.  All rights reserved.

C:\Users\suser>chcp 65001
Active code page: 65001

C:\Users\suser>type updated_dataset.csv
Name,Birth,City,Position
Иванов А.А.,22.03.1980,Москва,
Сорокин И.В.,07.08.1965,Волгоград,инженер
Белов М.М.,13.02.1980,Ростов,менеджер
Мельникова Д.С.,15.04.1985,Ростов,
Рыбина Е.П.,19.11.1985,Москва,инженер

C:\Users\suser>

In [28]:
frame = pd.read_csv('dataset.tsv',sep='\t',header=0)

In [29]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [30]:
frame.dtypes

Name        object
Birth       object
City        object
Position    object
dtype: object

In [31]:
frame.Birth=frame.Birth.apply(pd.to_datetime)

In [32]:
frame

              Name      Birth       City  Position
0      Иванов А.А. 1980-03-22     Москва       NaN
1     Сорокин И.В. 1965-07-08  Волгоград   инженер
2       Белов М.М. 1980-02-13     Ростов  менеджер
3  Мельникова Д.С. 1985-04-15     Ростов       NaN
4      Рыбина Е.П. 1985-11-19     Москва   инженер
5     Костров С.О. 1985-05-31     Москва    стажер

In [33]:
frame.dtypes

Name                object
Birth       datetime64[ns]
City                object
Position            object
dtype: object

In [34]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name        6 non-null object
Birth       6 non-null datetime64[ns]
City        6 non-null object
Position    4 non-null object
dtypes: datetime64[ns](1), object(3)
memory usage: 264.0+ bytes

In [35]:
frame.fillna('Разнорабочий',inplace=True)

In [36]:
frame

              Name      Birth       City      Position
0      Иванов А.А. 1980-03-22     Москва  Разнорабочий
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
2       Белов М.М. 1980-02-13     Ростов      менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  Разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер

In [37]:
frame.Position

0    Разнорабочий
1         инженер
2        менеджер
3    Разнорабочий
4         инженер
5          стажер
Name: Position, dtype: object

In [38]:
frame[['Position']]

       Position
0  Разнорабочий
1       инженер
2      менеджер
3  Разнорабочий
4       инженер
5        стажер

In [39]:
frame[['Name','Position']]

              Name      Position
0      Иванов А.А.  Разнорабочий
1     Сорокин И.В.       инженер
2       Белов М.М.      менеджер
3  Мельникова Д.С.  Разнорабочий
4      Рыбина Е.П.       инженер
5     Костров С.О.        стажер

In [40]:
frame.head(3)

           Name      Birth       City      Position
0   Иванов А.А. 1980-03-22     Москва  Разнорабочий
1  Сорокин И.В. 1965-07-08  Волгоград       инженер
2    Белов М.М. 1980-02-13     Ростов      менеджер

In [41]:
frame[:3]

           Name      Birth       City      Position
0   Иванов А.А. 1980-03-22     Москва  Разнорабочий
1  Сорокин И.В. 1965-07-08  Волгоград       инженер
2    Белов М.М. 1980-02-13     Ростов      менеджер

In [42]:
frame[3:]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  Разнорабочий
4      Рыбина Е.П. 1985-11-19  Москва       инженер
5     Костров С.О. 1985-05-31  Москва        стажер

In [43]:
frame.loc[[1,3,5],['Name','City']]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [45]:
frame.iloc[[1,3,5],[0,2]]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [46]:
frame.ix[[1,3,5],['Name','City']]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [47]:
frame.ix[[1,3,5],[0,2]]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [48]:
frame[frame.Birth>=pd.datetime(1985,1,1)]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  Разнорабочий
4      Рыбина Е.П. 1985-11-19  Москва       инженер
5     Костров С.О. 1985-05-31  Москва        стажер

In [49]:
frame[(frame.Birth>=pd.datetime(1985,1,1))&(frame.City!='Москва')]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  Разнорабочий

In [50]:
frame[(frame.Birth>=pd.datetime(1985,1,1)) | (frame.City=='Волгоград')]

              Name      Birth       City      Position
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
3  Мельникова Д.С. 1985-04-15     Ростов  Разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер